Prácticas/Práctica 4/Mediciones HTTPerf/HAProxy/HAProxy_1.txt
httperf --timeout=5 --client=0/1 --server=192.168.64.130 --port=80 --uri=/bench.php --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=27000 --num-calls=1
Maximum connect burst length: 3

Total: connections 27000 requests 9733 replies 571 test-duration 187.956 s

Connection rate: 143.7 conn/s (7.0 ms/conn, <=848 concurrent connections)
Connection time [ms]: min 53.5 avg 3992.0 max 8000.3 median 4400.5 stddev 2411.7
Connection time [ms]: connect 1243.9
Connection length [replies/conn]: 1.000

Request rate: 51.8 req/s (19.3 ms/req)
Request size [B]: 76.0

Reply rate [replies/s]: min 0.0 avg 3.1 max 43.8 stddev 7.5 (37 samples)
Reply time [ms]: response 3381.3 transfer 0.0
Reply size [B]: header 194.0 content 22.0 footer 0.0 (total 216.0)
Reply status: 1xx=0 2xx=571 3xx=0 4xx=0 5xx=0

CPU time [s]: user 99.71 system 87.75 (user 53.0% system 46.7% total 99.7%)
Net I/O: 4.5 KB/s (0.0*10^6 bps)

Errors: total 26429 client-timo 26429 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0