Prácticas/Práctica 4/Mediciones HTTPerf/HAProxy/HAProxy_2.txt
httperf --timeout=5 --client=0/1 --server=192.168.64.130 --port=80 --uri=/bench.php --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=27000 --num-calls=1
Maximum connect burst length: 13

Total: connections 27000 requests 9901 replies 742 test-duration 187.907 s

Connection rate: 143.7 conn/s (7.0 ms/conn, <=852 concurrent connections)
Connection time [ms]: min 79.5 avg 4499.7 max 8000.3 median 4684.5 stddev 2286.7
Connection time [ms]: connect 1220.5
Connection length [replies/conn]: 1.000

Request rate: 52.7 req/s (19.0 ms/req)
Request size [B]: 76.0

Reply rate [replies/s]: min 0.0 avg 4.0 max 45.2 stddev 8.0 (37 samples)
Reply time [ms]: response 3766.8 transfer 0.0
Reply size [B]: header 194.0 content 22.0 footer 0.0 (total 216.0)
Reply status: 1xx=0 2xx=742 3xx=0 4xx=0 5xx=0

CPU time [s]: user 80.94 system 106.48 (user 43.1% system 56.7% total 99.7%)
Net I/O: 4.7 KB/s (0.0*10^6 bps)

Errors: total 26258 client-timo 26258 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0