Prácticas/Práctica 4/Mediciones HTTPerf/HAProxy/HAProxy_3.txt
httperf --timeout=5 --client=0/1 --server=192.168.64.130 --port=80 --uri=/bench.php --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=27000 --num-calls=1
Maximum connect burst length: 2

Total: connections 27000 requests 9795 replies 783 test-duration 187.993 s

Connection rate: 143.6 conn/s (7.0 ms/conn, <=870 concurrent connections)
Connection time [ms]: min 56.4 avg 4788.9 max 7999.9 median 4681.5 stddev 2162.9
Connection time [ms]: connect 1232.8
Connection length [replies/conn]: 1.000

Request rate: 52.1 req/s (19.2 ms/req)
Request size [B]: 76.0

Reply rate [replies/s]: min 0.0 avg 4.1 max 35.0 stddev 6.6 (37 samples)
Reply time [ms]: response 3941.9 transfer 0.0
Reply size [B]: header 194.0 content 22.0 footer 0.0 (total 216.0)
Reply status: 1xx=0 2xx=783 3xx=0 4xx=0 5xx=0

CPU time [s]: user 100.34 system 87.11 (user 53.4% system 46.3% total 99.7%)
Net I/O: 4.7 KB/s (0.0*10^6 bps)

Errors: total 26217 client-timo 26217 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0