Prácticas/Práctica 4/Mediciones HTTPerf/HAProxy/HAProxy_5.txt
httperf --timeout=5 --client=0/1 --server=192.168.64.130 --port=80 --uri=/bench.php --rate=150 --send-buffer=4096 --recv-buffer=16384 --num-conns=27000 --num-calls=1
Maximum connect burst length: 3

Total: connections 27000 requests 9622 replies 569 test-duration 187.985 s

Connection rate: 143.6 conn/s (7.0 ms/conn, <=873 concurrent connections)
Connection time [ms]: min 41.7 avg 4766.8 max 7993.2 median 4646.5 stddev 2111.8
Connection time [ms]: connect 1243.4
Connection length [replies/conn]: 1.000

Request rate: 51.2 req/s (19.5 ms/req)
Request size [B]: 76.0

Reply rate [replies/s]: min 0.0 avg 3.0 max 25.8 stddev 4.9 (37 samples)
Reply time [ms]: response 3960.0 transfer 0.0
Reply size [B]: header 194.0 content 22.0 footer 0.0 (total 216.0)
Reply status: 1xx=0 2xx=569 3xx=0 4xx=0 5xx=0

CPU time [s]: user 99.05 system 88.26 (user 52.7% system 47.0% total 99.6%)
Net I/O: 4.4 KB/s (0.0*10^6 bps)

Errors: total 26431 client-timo 26431 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0